#include "Int_MatrixKey.h"

static u8 s_lines[4] = {
    0xFE, // 扫描第一行时 P2 寄存器的值
    0xFD, // 扫描第二行时 P2 寄存器的值
    0xFB, // 扫描第三行时 P2 寄存器的值
    0xF7, // 扫描第四行时 P2 寄存器的值
};

/**
 * @brief 检测矩阵按键中哪个按键被触发
 *
 * @return u8 按键编号 5 ~ 20
 */
u8 Int_MatrixKey_Checkkey()
{
    u8 i;

    // 循环4次，逐行扫描
    for (i = 0; i < 4; i++)
    {
        // 设置P2寄存器的值
        P2 = s_lines[i];
        // 检测本行第一个按键是否触发
        if (P24 == 0)
        {
            Delayms(10);
            if (P24 == 0)
            {
                while (P24 == 0)
                    ;
                return 5 + 4 * i;
            }
        }
        // 检测本行第二个按键是否触发
        if (P25 == 0)
        {
            Delayms(10);
            if (P25 == 0)
            {
                while (P25 == 0)
                    ;
                return 6 + 4 * i;
            }
        }
        // 检测本行第三个按键是否触发
        if (P26 == 0)
        {
            Delayms(10);
            if (P26 == 0)
            {
                while (P26 == 0)
                    ;
                return 7 + 4 * i;
            }
        }
        // 检测本行第四个按键是否触发
        if (P27 == 0)
        {
            Delayms(10);
            if (P27 == 0)
            {
                while (P27 == 0)
                    ;
                return 8 + 4 * i;
            }
        }
    }
    
    // 没有按键按下返回0
    return 0;


    // // 扫描第一行 ----------------------
    // // P2 寄存器中 P20 置0，其他位是0    寄存器值： 1111 1110
    // P2 = 0xFE;
    // // 检测第一行第一个按键是否触发
    // if (P24 == 0)
    // {
    //     Delayms(10);
    //     if (P24 == 0)
    //     {
    //         while (P24 == 0)
    //             ;
    //         return 5;
    //     }
    // }
    // // 检测第一行第二个按键是否触发
    // if (P25 == 0)
    // {
    //     Delayms(10);
    //     if (P25 == 0)
    //     {
    //         while (P25 == 0)
    //             ;
    //         return 6;
    //     }
    // }
    // // 检测第一行第三个按键是否触发
    // if (P26 == 0)
    // {
    //     Delayms(10);
    //     if (P26 == 0)
    //     {
    //         while (P26 == 0)
    //             ;
    //         return 7;
    //     }
    // }
    // // 检测第一行第四个按键是否触发
    // if (P27 == 0)
    // {
    //     Delayms(10);
    //     if (P27 == 0)
    //     {
    //         while (P27 == 0)
    //             ;
    //         return 8;
    //     }
    // }

    // // 扫描第二行 ----------------------
    // // P2 寄存器中 P20 置0，其他位是0    寄存器值： 1111 1101
    // P2 = 0xFD;
    // // 检测第二行第一个按键是否触发
    // if (P24 == 0)
    // {
    //     Delayms(10);
    //     if (P24 == 0)
    //     {
    //         while (P24 == 0)
    //             ;
    //         return 9;
    //     }
    // }
    // // 检测第二行第二个按键是否触发
    // if (P25 == 0)
    // {
    //     Delayms(10);
    //     if (P25 == 0)
    //     {
    //         while (P25 == 0)
    //             ;
    //         return 10;
    //     }
    // }
    // // 检测第二行第三个按键是否触发
    // if (P26 == 0)
    // {
    //     Delayms(10);
    //     if (P26 == 0)
    //     {
    //         while (P26 == 0)
    //             ;
    //         return 11;
    //     }
    // }
    // // 检测第二行第四个按键是否触发
    // if (P27 == 0)
    // {
    //     Delayms(10);
    //     if (P27 == 0)
    //     {
    //         while (P27 == 0)
    //             ;
    //         return 12;
    //     }
    // }

    // // 扫描第三行 ----------------------
    // // P2 寄存器中 P20 置0，其他位是0    寄存器值： 1111 1011
    // P2 = 0xFB;

    // // 扫描第四行 ----------------------
    // // P2 寄存器中 P20 置0，其他位是0    寄存器值： 1111 0111
    // P2 = 0xF7;

    // return 0;
}