#include "Com_Util.h"

// 主函数 定时器0
void main()
{
    // 1. 启动定时器0 ---------------------------------------------------------
    // 1.1 总开关
    EA = 1;
    // 1.2 定时器0开关
    ET0 = 1;

    // 2. 设置定时器脉冲来源和工作模式  设置脉冲来源是系统时钟(定时器方式)； 设置工作模式是 01 -----------
    // 定时器0的 C/T为是第2位， M1是第1为，M0是第0位， 同时设置GATE=0
    // 2.1 将TMOD寄存器的后四位先置0  TMOD & 0b11110000
    TMOD &= 0xF0;
    // 2.2 给后四位置为 0001
    TMOD |= 0x01;

    // 3. 设置脉冲计数器的初始值，每1ms触发一次中断，经过计算初始值是64614  -------------------------------
    // 11111100 01100110
    // 存低8位
    TL0 = 64614;
    TH0 = 64614 >> 8;

    // 4. 设置定时器0的优先级 （省略，默认值是 00） -----------------------------------

    // 5. 启动定时器（开始计数）
    TR0 = 1;

    // 死循环
    while (1)
        ;
}

// 6. 定义定时器0的中断服务程序 ---------------------------------------
void Timer0_Handler() interrupt 1
{
    static u16 count = 1000;

    // 重新设置脉冲计数器的起始值
    TL0 = 64614;
    TH0 = 64614 >> 8;

    if (count == 0)
    {
        P00 = ~P00;
        count = 1000;
    }

    count--;
}
